work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-21-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=21 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 21

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140112
        write:                           0
        other:                           20016
        total:                           160128
    transactions:                        10008  (7312.71 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140112 (102377.96 per sec.)
    other operations:                    20016  (14625.42 per sec.)

Test execution summary:
    total time:                          1.3686s
    total number of events:              10008
    total time taken by event execution: 28.5955
    per-request statistics:
         min:                                  1.48ms
         avg:                                  2.86ms
         max:                                  4.14ms
         approx.  95 percentile:               3.82ms

Threads fairness:
    events (avg/stddev):           476.5714/160.07
    execution time (avg/stddev):   1.3617/0.00