work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-21-3
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=21 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 21

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140084
        write:                           0
        other:                           20012
        total:                           160096
    transactions:                        10006  (7144.10 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140084 (100017.36 per sec.)
    other operations:                    20012  (14288.19 per sec.)

Test execution summary:
    total time:                          1.4006s
    total number of events:              10006
    total time taken by event execution: 29.2596
    per-request statistics:
         min:                                  1.63ms
         avg:                                  2.92ms
         max:                                  4.69ms
         approx.  95 percentile:               3.96ms

Threads fairness:
    events (avg/stddev):           476.4762/147.25
    execution time (avg/stddev):   1.3933/0.00