work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-5-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=5 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 5

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140000
        write:                           0
        other:                           20000
        total:                           160000
    transactions:                        10000  (2938.87 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140000 (41144.13 per sec.)
    other operations:                    20000  (5877.73 per sec.)

Test execution summary:
    total time:                          3.4027s
    total number of events:              10000
    total time taken by event execution: 16.9511
    per-request statistics:
         min:                                  1.44ms
         avg:                                  1.70ms
         max:                                  2.79ms
         approx.  95 percentile:               2.24ms

Threads fairness:
    events (avg/stddev):           2000.0000/179.07
    execution time (avg/stddev):   3.3902/0.00