work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-79-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=79 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 79

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140420
        write:                           0
        other:                           20060
        total:                           160480
    transactions:                        10030  (17666.48 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140420 (247330.72 per sec.)
    other operations:                    20060  (35332.96 per sec.)

Test execution summary:
    total time:                          0.5677s
    total number of events:              10030
    total time taken by event execution: 44.1178
    per-request statistics:
         min:                                  1.81ms
         avg:                                  4.40ms
         max:                                  8.95ms
         approx.  95 percentile:               5.46ms

Threads fairness:
    events (avg/stddev):           126.9620/30.25
    execution time (avg/stddev):   0.5585/0.00